{
  "scope": "problem7-gaps-kb",
  "count": 22,
  "papers": [
    {
      "id": "1204.4667",
      "title": "Finiteness properties for some rational Poincaré duality groups",
      "date": "2012-04-20",
      "authors": [
        "Jim Fowler"
      ],
      "cats": [
        "math.GT",
        "math.GR"
      ],
      "summary": "A combination of Bestvina--Brady Morse theory and an acyclic reflection group trick produces a torsion-free finitely presented Q-Poincaré duality group which is not the fundamental group of an aspherical closed ANR Q-homology manifold. The acyclic construction suggests asking which Q-Poincaré duality groups act freely on Q-acyclic spaces, i.e., which groups are FH(Q). For example, the orbifold fundamental group Γ of a good orbifold satisfies Q-Poincaré duality, and we show Γ is FH(Q) if the Euler characteristics of certain fixed sets vanish.",
      "url": "https://arxiv.org/abs/1204.4667",
      "tags": [
        "G1",
        "E2"
      ],
      "why": "FH(Q) criterion and fixed-set Euler input."
    },
    {
      "id": "1506.06293",
      "title": "Rational manifold models for duality groups",
      "date": "2015-06-20",
      "authors": [
        "Grigori Avramidi"
      ],
      "cats": [
        "math.GT"
      ],
      "summary": "We show that a finite type duality group of dimension $d>2$ is the fundamental group of a $(d+3)$-manifold with rationally acyclic universal cover. We use this to find closed manifolds with rationally acyclic universal cover and some nonvanishing $L^2$-Betti numbers outside the middle dimension, which contradicts a rational analogue of a conjecture of Singer.",
      "url": "https://arxiv.org/abs/1506.06293",
      "tags": [
        "G2"
      ],
      "why": "Rational manifold models and rational surgery pipeline."
    },
    {
      "id": "1311.7629",
      "title": "Bredon-Poincare Duality Groups",
      "date": "2013-11-29",
      "authors": [
        "Simon St John-Green"
      ],
      "cats": [
        "math.GR",
        "math.AT"
      ],
      "summary": "If $G$ is a group which admits a manifold model for $\\mathrm{B}G$ then $G$ is a Poincaré duality group. We study a generalisation of Poincaré duality groups, introduced initially by Davis and Leary, motivated by groups $G$ with cocompact manifold models $M$ for $\\underline{\\mathrm{E}}G$ where $M^H$ is a contractible submanifold for all finite subgroups $H$ of $G$. We give several sources of examples and constructions of these Bredon-Poincaré duality groups, including using the equivariant reflection group trick of Davis and Leary to construct examples of Bredon-Poincaré duality groups arising from actions on manifolds $M$ where the dimensions of the submanifolds $M^H$ are specified. We classify Bredon-Poincaré duality groups in low dimensions, and discuss behaviour under group extensions and graphs of groups.",
      "url": "https://arxiv.org/abs/1311.7629",
      "tags": [
        "G1"
      ],
      "why": "Bredon-Poincare duality framework with torsion."
    },
    {
      "id": "0705.3249",
      "title": "Translation Groupoids and Orbifold Bredon Cohomology",
      "date": "2007-05-22",
      "authors": [
        "Dorette Pronk",
        "Laura Scull"
      ],
      "cats": [
        "math.AT",
        "math.CT"
      ],
      "summary": "We show that the bicategory of (representable) orbifolds and good maps is equivalent to the bicategory of orbifold translation groupoids and generalized equivariant maps. We use this result to define an orbifold version of Bredon cohomology.",
      "url": "https://arxiv.org/abs/0705.3249",
      "tags": [
        "G1"
      ],
      "why": "Orbifold/groupoid cohomological infrastructure."
    },
    {
      "id": "math/0312378",
      "title": "Survey on Classifying Spaces for Families of Subgroups",
      "date": "2003-12-19",
      "authors": [
        "Wolfgang Lueck"
      ],
      "cats": [
        "math.GT"
      ],
      "summary": "We define for a topological group G and a family of subgroups F two versions for the classifying space for the family F, the G-CW-version E_F(G) and the numerable G-space version J_F(G). They agree if G is discrete, or if G is a Lie group and each element in F compact, or if F is the family of compact subgroups. We discuss special geometric models for these spaces for the family of compact open groups in special cases such as almost connected groups G and word hyperbolic groups G. We deal with the question whether there are finite models, models of finite type, finite dimensional models. We also discuss the relevance of these spaces for the Baum-Connes Conjecture about the topological K-theory of the reduced group C^*-algebra, for the Farrell-Jones Conjecture about the algebraic K- and L-theory of group rings, for Completion Theorems and for classifying spaces for equivariant vector bundles and for other situations.",
      "url": "https://arxiv.org/abs/math/0312378",
      "tags": [
        "G1",
        "FJ"
      ],
      "why": "Classifying spaces for families, E_FIN/E_VCYC context."
    },
    {
      "id": "math/0510602",
      "title": "Coefficients for the Farrell-Jones Conjecture",
      "date": "2005-10-27",
      "authors": [
        "Arthur Bartels",
        "Holger Reich"
      ],
      "cats": [
        "math.KT"
      ],
      "summary": "We introduce the Farrell-Jones Conjecture with coefficients in an additive category with G-action. This is a variant of the Farrell-Jones Conjecture about the algebraic K- or L-Theory of a group ring RG. It allows to treat twisted group rings and crossed product rings. The conjecture with coefficients is stronger than the original conjecture but it has better inheritance properties. Since known proofs using controlled algebra carry over to the set-up with coefficients we obtain new results about the original Farrell-Jones Conjecture. The conjecture with coefficients implies the fibered version of the Farrell-Jones Conjecture.",
      "url": "https://arxiv.org/abs/math/0510602",
      "tags": [
        "FJ"
      ],
      "why": "Assembly-map and K/L-theory framework survey."
    },
    {
      "id": "1003.5002",
      "title": "K- and L-theory of group rings",
      "date": "2010-03-25",
      "authors": [
        "Wolfgang Lueck"
      ],
      "cats": [
        "math.GT"
      ],
      "summary": "This article will explore the K- and L-theory of group rings and their applications to algebra, geometry and topology. The Farrell-Jones Conjecture characterizes K- and L-theory groups. It has many implications, including the Borel and Novikov Conjectures for topological rigidity. Its current status, and many of its consequences are surveyed.",
      "url": "https://arxiv.org/abs/1003.5002",
      "tags": [
        "FJ"
      ],
      "why": "K/L-theory overview with Farrell-Jones context."
    },
    {
      "id": "1007.0845",
      "title": "On the K- and L-theory of hyperbolic and virtually finitely generated abelian groups",
      "date": "2010-07-06",
      "authors": [
        "Wolfgang Lueck",
        "David Rosenthal"
      ],
      "cats": [
        "math.KT"
      ],
      "summary": "We investigate the algebraic K- and L-theory of the group ring RG, where G is a hyperbolic or virtually finitely generated abelian group and R is an associative ring with unit.",
      "url": "https://arxiv.org/abs/1007.0845",
      "tags": [
        "FJ",
        "U3"
      ],
      "why": "Computational K/L-theory patterns for virtually cyclic actions."
    },
    {
      "id": "1805.00226",
      "title": "Assembly Maps",
      "date": "2018-05-01",
      "authors": [
        "Wolfgang Lueck"
      ],
      "cats": [
        "math.KT"
      ],
      "summary": "We introduce and analyze the concept of an assembly map from the original homotopy theoretic point of view. We give also interpretations in terms of surgery theory, controlled topology and index theory. The motivation is that prominent conjectures of Farrell-Jones and Baum-Connes about K- and L-theory of group rings and group C^*-algebras predict that certain assembly maps are weak homotopy equivalences.",
      "url": "https://arxiv.org/abs/1805.00226",
      "tags": [
        "FJ"
      ],
      "why": "Modern isomorphism-conjecture survey and assembly interpretations."
    },
    {
      "id": "1101.0469",
      "title": "The Farrell-Jones Conjecture for cocompact lattices in virtually connected Lie groups",
      "date": "2011-01-03",
      "authors": [
        "Arthur Bartels",
        "F. T. Farrell",
        "Wolfgang Lueck"
      ],
      "cats": [
        "math.GT"
      ],
      "summary": "Let G be a cocompact lattice in a virtually connected Lie group or the fundamental group of a 3-manifold. We prove the K-theoretic Farrell-Jones Conjecture (up to dimension one) and the L-theoretic Farrell-Jones Conjecture for G, where we allow coefficients in additive G-categories with (involution).",
      "url": "https://arxiv.org/abs/1101.0469",
      "tags": [
        "FJ"
      ],
      "why": "FJ for cocompact lattices in virtually connected Lie groups."
    },
    {
      "id": "1401.0876",
      "title": "The Farrell-Jones conjecture for arbitrary lattices in virtually connected Lie groups",
      "date": "2014-01-05",
      "authors": [
        "Holger Kammeyer",
        "Wolfgang Lueck",
        "Henrik Rueping"
      ],
      "cats": [
        "math.KT"
      ],
      "summary": "We prove the K- and the $L$-theoretic Farrell-Jones conjecture with coefficients in additive categories and with finite wreath products for arbitrary lattices in virtually connected Lie groups.",
      "url": "https://arxiv.org/abs/1401.0876",
      "tags": [
        "FJ"
      ],
      "why": "FJ for arbitrary lattices in virtually connected Lie groups."
    },
    {
      "id": "0905.0104",
      "title": "Surgery obstructions on closed manifolds and the Inertia subgroup",
      "date": "2009-05-01",
      "authors": [
        "Ian Hambleton"
      ],
      "cats": [
        "math.GT",
        "math.AT"
      ],
      "summary": "The Wall surgery obstruction groups have two interesting geometrically defined subgroups, consisting of the surgery obstructions between closed manifolds, and the inertial elements. We show that the inertia group $I_{n+1}(π,w)$ and the closed manifold subgroup $C_{n+1}(π,w)$ are equal in dimensions $n+1\\geq 6$, for any finitely-presented group $π$ and any orientation character $w\\colon π\\to \\cy 2$.",
      "url": "https://arxiv.org/abs/0905.0104",
      "tags": [
        "G3"
      ],
      "why": "Closed-manifold subgroup and surgery-obstruction interface."
    },
    {
      "id": "math/0306054",
      "title": "The surgery obstruction groups of the infinite dihedral group",
      "date": "2003-06-03",
      "authors": [
        "Francis X. Connolly",
        "James F. Davis"
      ],
      "cats": [
        "math.GT",
        "math.KT"
      ],
      "summary": "This paper computes the quadratic Witt groups (the Wall L-groups) of the polynomial ring Z[t] and the integral group ring of the infinite dihedral group, with various involutions. We show that some of these groups are infinite direct sums of cyclic groups of order 2 and 4. The techniques used are quadratic linking forms over Z[t] and Arf invariants.",
      "url": "https://arxiv.org/abs/math/0306054",
      "tags": [
        "U3"
      ],
      "why": "Explicit L-group computations with torsion/orientation characters."
    },
    {
      "id": "1707.07960",
      "title": "Wall's finiteness obstruction",
      "date": "2017-07-25",
      "authors": [
        "Erik Kjær Pedersen"
      ],
      "cats": [
        "math.GT",
        "math.AT",
        "math.KT"
      ],
      "summary": "The purpose of this note is to give a self contained description of Walls finiteness obstruction.",
      "url": "https://arxiv.org/abs/1707.07960",
      "tags": [
        "G1"
      ],
      "why": "Finiteness obstruction background and Wall-style perspectives."
    },
    {
      "id": "math/0008070",
      "title": "A survey of Wall's finiteness obstruction",
      "date": "2000-08-09",
      "authors": [
        "Steve Ferry",
        "Andrew Ranicki"
      ],
      "cats": [
        "math.AT",
        "math.GT"
      ],
      "summary": "Wall's finiteness obstruction is an algebraic K-theory invariant which decides if a finitely dominated space is homotopy equivalent to a finite CW complex. The object of this survey is to describe the invariant (which was first formulated in 1965) and some of its many applications to the surgery classification of manifolds.",
      "url": "https://arxiv.org/abs/math/0008070",
      "tags": [
        "G1"
      ],
      "why": "Finiteness/PD obstruction background used in reduced wiring."
    },
    {
      "id": "1705.10909",
      "title": "The equivariant Spivak normal bundle and equivariant surgery for compact Lie groups",
      "date": "2017-05-31",
      "authors": [
        "Steven R. Costenoble",
        "Stefan Waner"
      ],
      "cats": [
        "math.AT"
      ],
      "summary": "We generalize the results of a previous paper of ours to compact Lie groups. Using a recently developed ordinary equivariant homology and cohomology, we define equivariant Poincare complexes with the properties that (1) every compact G-manifold is an equivariant Poincare complex, (2) every finite equivariant Poincare complex (with some mild additional hypotheses) has an equivariant spherical Spivak normal fibration, and (3) the Pi-Pi Theorem holds for equivariant Poincare pairs under suitable gap hypotheses. The nice behavior of the ordinary equivariant homology and cohomology theories allows us to follow Wall's original line of argument closely.",
      "url": "https://arxiv.org/abs/1705.10909",
      "tags": [
        "G2",
        "G3"
      ],
      "why": "Equivariant Spivak normal bundle and equivariant surgery."
    },
    {
      "id": "2304.00880",
      "title": "A note on non-simply connected rational homotopy models",
      "date": "2023-04-03",
      "authors": [
        "Syunji Moriya"
      ],
      "cats": [
        "math.AT"
      ],
      "summary": "In their generalization of the rational homotopy theory to non-simply connected spaces, Gómez-Tato--Halperin--Tanré adopted local systems of commutative differential graded algebras (CDGA's) as algebraic models. As another non-simply connected rational model, a $π_1$-equivariant CDGA with a semi-simple action was introduced by Hain and studied by Katzarkov-Pantev-Toën and Pridham. These models have their own advantages and direct comparison might be important. In this note, we present an example of local system of CDGA's which is a non-nilpotent version of an example given by Gómez-Tato et al., and compute the corresponding $π_1$-equivariant CDGA. We also see how some homotopy invariants such as homotopy groups and twisted cohomology are algebraically recovered from the equivariant CDGA with this example. We also describe a general procedure to obtain the corresponding equivariant CDGA model from a local system model in the case of $π_1=\\mathbb{Z}\\times \\mathbb{Z}$.",
      "url": "https://arxiv.org/abs/2304.00880",
      "tags": [
        "G1",
        "G3"
      ],
      "why": "Non-simply-connected rational homotopy models; reference candidate."
    },
    {
      "id": "1106.1704",
      "title": "Smith theory, L2 cohomology, isometries of locally symmetric manifolds and moduli spaces of curves",
      "date": "2011-06-09",
      "authors": [
        "Grigori Avramidi"
      ],
      "cats": [
        "math.GT",
        "math.AT"
      ],
      "summary": "We investigate periodic diffeomorphisms of non-compact aspherical manifolds (and orbifolds) and describe a class of spaces that have no homotopically trivial periodic diffeomorphisms. Prominent examples are moduli spaces of curves and aspherical locally symmetric spaces with non-vanishing Euler characteristic. In the irreducible locally symmetric case, we show that no complete metric has more symmetry than the locally symmetric metric. In the moduli space case, we build on work of Farb and Weinberger and prove an analogue of Royden's theorem for complete finite volume metrics.",
      "url": "https://arxiv.org/abs/1106.1704",
      "tags": [
        "E2"
      ],
      "why": "Smith-theory constraints for periodic actions on locally symmetric spaces."
    },
    {
      "id": "2506.23994",
      "title": "On reflections of congruence hyperbolic manifolds",
      "date": "2025-06-30",
      "authors": [
        "Sami Douba",
        "Franco Vargas Pallete"
      ],
      "cats": [
        "math.GT",
        "math.DG"
      ],
      "summary": "We show that the standard method for constructing closed hyperbolic manifolds of arbitrary dimension possessing reflective symmetries typically produces reflections whose fixed point sets are nonseparating.",
      "url": "https://arxiv.org/abs/2506.23994",
      "tags": [
        "E2"
      ],
      "why": "Reflection congruence-manifold construction with fixed hypersurfaces."
    },
    {
      "id": "math/0406607",
      "title": "Finite Groups and Hyperbolic Manifolds",
      "date": "2004-06-29",
      "authors": [
        "M. Belolipetsky",
        "A. Lubotzky"
      ],
      "cats": [
        "math.GR",
        "math.GT"
      ],
      "summary": "The isometry group of a compact n-dimensional hyperbolic manifold is known to be finite. We show that for every n > 2, every finite group is realized as the full isometry group of some compact hyperbolic n-manifold. The cases n = 2 and n = 3 have been proven by Greenberg and Kojima, respectively. Our proof is non constructive: it uses counting results from subgroup growth theory and the strong approximation theorem to show that such manifolds exist.",
      "url": "https://arxiv.org/abs/math/0406607",
      "tags": [
        "E2"
      ],
      "why": "Finite-group realization in compact hyperbolic manifolds."
    },
    {
      "id": "1209.2484",
      "title": "On the number of finite subgroups of a lattice",
      "date": "2012-09-12",
      "authors": [
        "Iddo Samet"
      ],
      "cats": [
        "math.GR",
        "math.DG"
      ],
      "summary": "We show that the number of conjugacy classes of maximal finite subgroups of a lattice in a semisimple Lie group is linearly bounded by the covolume of the lattice. Moreover, for higher rank groups, we show that this number grows sublinearly with covolume. We obtain similar results for isotropy subgroups in lattices. Geometrically, this yields volume bounds for the number of strata in the natural stratification of a finite-volume locally symmetric orbifold.",
      "url": "https://arxiv.org/abs/1209.2484",
      "tags": [
        "E2"
      ],
      "why": "Finite subgroup/isotropy complexity bounds for lattices."
    },
    {
      "id": "2012.15322",
      "title": "Homology bounds for hyperbolic orbifolds",
      "date": "2020-12-30",
      "authors": [
        "Hartwig Senska"
      ],
      "cats": [
        "math.GT",
        "math.AT"
      ],
      "summary": "We will provide bounds on both the Betti numbers and the torsion part of the homology of hyperbolic orbifolds. These bounds are linear in the volume and are a direct consequence of an efficient simplicial model of the thick part, which we will construct as well. The homology statements complement previous work of Bader, Gelander and Sauer (torsion homology of manifolds), Samet (Betti numbers of orbifolds) and a classical theorem of Gromov (Betti numbers of manifolds). For arithmetic, non-compact hyperbolic orbifolds -- i.e. in the case of arithmetic, non-uniform lattices in $\\operatorname{Isom}(\\mathbb{H}^n)$ -- the strongest results will be obtained.",
      "url": "https://arxiv.org/abs/2012.15322",
      "tags": [
        "E2",
        "FJ"
      ],
      "why": "Hyperbolic orbifold homology bounds and volume-scaling controls."
    }
  ],
  "by_tag_counts": {
    "E2": 6,
    "FJ": 8,
    "G1": 7,
    "G2": 2,
    "G3": 3,
    "U3": 2
  }
}